In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2008_0715/02102.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(7, 40)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
0,"U.S. Representative, District 5 Democratic 100...",NaN,NaN,NaN,"Hutchins 8,287","Lewis 36,713","Thomas 8,185","Totals 53,185",NaN,NaN,...,9649.0,1200.0,12442.0,FULTON,220.0,220.0,6487.0,26538.0,6839.0,39864.0
1,NaN,NaN,NaN,"Hutchins 8,287","Lewis 36,713","Thomas 8,185","Totals 53,185",NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,15.6%,69.0%,15.4%,100.0%,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PR,TP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CLAYTON,8,8,207,526,146,879,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,30,31,32,33,34,35,36,37,38,39
4,CLAYTON,8,8,207,526,146,879,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,DEKALB,43,43,1593,9649,1200,12442,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,FULTON,220,220,6487,26538,6839,39864,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,3,4,5]]]

In [9]:
df.head(5)

         0     3      4     5
4  CLAYTON   207    526   146
5   DEKALB  1593   9649  1200
6   FULTON  6487  26538  6839

In [10]:
df.columns = ['county', 'Markel Hutchins', 'John Lewis', 'Able Mable Thomas']

In [11]:
df.tail(5)

    county Markel Hutchins John Lewis Able Mable Thomas
4  CLAYTON             207        526               146
5   DEKALB            1593       9649              1200
6   FULTON            6487      26538              6839

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

    county        candidate votes
0  CLAYTON  Markel Hutchins   207
1   DEKALB  Markel Hutchins  1593
2   FULTON  Markel Hutchins  6487
3  CLAYTON       John Lewis   526
4   DEKALB       John Lewis  9649

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
county       9 non-null object
candidate    9 non-null object
votes        9 non-null int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '5'

In [19]:
df['party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
Able Mable Thomas  Democrat     8185
John Lewis         Democrat    36713
Markel Hutchins    Democrat     8287
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district     party        candidate  votes
0  CLAYTON  U.S. Representative        5  Democrat  Markel Hutchins    207
1   DEKALB  U.S. Representative        5  Democrat  Markel Hutchins   1593
2   FULTON  U.S. Representative        5  Democrat  Markel Hutchins   6487
3  CLAYTON  U.S. Representative        5  Democrat       John Lewis    526
4   DEKALB  U.S. Representative        5  Democrat       John Lewis   9649

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')